In [14]:
import pandas as pd
import matplotlib.pyplot as plt
plt.style.use('seaborn-white')
import numpy as np

In [15]:
df = pd.read_csv('train.csv')
df

              date  store  item  sales
0       2013-01-01      1     1     13
1       2013-01-02      1     1     11
2       2013-01-03      1     1     14
3       2013-01-04      1     1     13
4       2013-01-05      1     1     10
...            ...    ...   ...    ...
912995  2017-12-27     10    50     63
912996  2017-12-28     10    50     59
912997  2017-12-29     10    50     74
912998  2017-12-30     10    50     62
912999  2017-12-31     10    50     82

[913000 rows x 4 columns]

In [16]:
df.describe()

               store           item          sales
count  913000.000000  913000.000000  913000.000000
mean        5.500000      25.500000      52.250287
std         2.872283      14.430878      28.801144
min         1.000000       1.000000       0.000000
25%         3.000000      13.000000      30.000000
50%         5.500000      25.500000      47.000000
75%         8.000000      38.000000      70.000000
max        10.000000      50.000000     231.000000

In [26]:
df['date'] = pd.to_datetime(df['date'])
df['date'] = df['date'].dt.strftime('%Y-%m')

In [27]:
df

           date  store  item  sales
0       2013-01      1     1     13
1       2013-01      1     1     11
2       2013-01      1     1     14
3       2013-01      1     1     13
4       2013-01      1     1     10
...         ...    ...   ...    ...
912995  2017-12     10    50     63
912996  2017-12     10    50     59
912997  2017-12     10    50     74
912998  2017-12     10    50     62
912999  2017-12     10    50     82

[913000 rows x 4 columns]

In [32]:
dff = df.groupby(["date","item","store"]).sales.sum().reset_index()

In [33]:
dff

          date  item  store  sales
0      2013-01     1      1    328
1      2013-01     1      2    486
2      2013-01     1      3    453
3      2013-01     1      4    388
4      2013-01     1      5    294
...        ...   ...    ...    ...
29995  2017-12    50      6   1322
29996  2017-12    50      7   1175
29997  2017-12    50      8   2125
29998  2017-12    50      9   1826
29999  2017-12    50     10   1987

[30000 rows x 4 columns]

In [1]:
df.plot(x = 'item',y ='sales',type='bar')
plt.show()

NameError: name 'df' is not defined

Show sales wrt the month with different store

Show sales wrt the different items